# Specify a directory to install
cask_args appdir: "/Applications"

# Taps
tap "tw93/tap"
tap "heroku/brew"
tap "pointfreeco/tap"

# Install packages
brew "coreutils"
brew "stow"
brew "git"
brew "git-lfs"
brew "wifi-password"
brew "starship"
brew "fish"
brew "awscli"
brew "qmk"
brew "ruby-install"
brew "chruby-fish"
brew "direnv"
brew "bats-core"
brew "ffmpeg"
brew "ffmpeg@6"
brew "gh"
brew "heroku"
brew "ios-deploy"
brew "llvm@19"
brew "mise"
brew "mole"
brew "node"
brew "p7zip"
brew "pfw"
brew "pre-commit"
brew "protobuf"
brew "rust"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "uv"
brew "watchman"
brew "wget"
brew "z"
brew "eza"
brew "bat"
brew "xcbeautify"
brew "xcode-build-server"

# Casks
cask "1password"
cask "1password-cli"
cask "blender"
cask "calibre"
cask "cursor"
cask "discord"
cask "dropbox"
cask "figma"
cask "iterm2"
cask "imagealpha"
cask "imageoptim"
cask "hey"
cask "hey-desktop"
cask "linear-linear"
cask "notion"
cask "proxyman"
cask "qmk-toolbox"
cask "raycast"
cask "slack"
cask "tower"
cask "google-chrome"
cask "vial"
cask "vlc"
cask "transmission"
cask "ghostty"
cask "zulu@17"
