# Specify a directory to install
cask_args appdir: "/Applications"

# Install packages
brew "coreutils"
brew "stow"
brew "git"
brew "git-lfs"
brew "wifi-password"
brew "starship"
brew "z"
brew "antidote"
brew "fish"
brew "awscli"
brew "qmk"
brew "ruby-install"
brew "chruby-fish"

# Casks
cask "1password"
cask "1password-cli"
cask "calibre"
cask "dropbox"
cask "iterm2"
cask "imagealpha"
cask "imageoptim"
cask "hey"
cask "notion"
cask "qmk-toolbox"
cask "slack"
cask "tower"
cask "firefox"
cask "google-chrome"
cask "vlc"
cask "transmission"
