# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap 'homebrew/cask' || true
brew "stow"
brew 'git'
brew 'git-lfs'
brew 'postgres'
brew 'terminal-notifier'
brew 'wifi-password'
brew 'zsh'
brew 'starship'
brew 'z'

# Casks
cask 'iterm2'
cask 'visual-studio-code'
cask 'imagealpha'
cask 'imageoptim'
cask 'chromium'
cask 'firefox'
cask 'vlc'
cask 'transmission'
cask 'calibre'