# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap 'homebrew/cask' || true
brew "stow"
brew 'coreutils'
brew 'moreutils'
brew 'wget'
brew 'git'
brew 'git-lfs'
brew 'imagemagick'
brew 'ffmpeg'
brew 'yarn'
brew 'zlib'
brew 'postgres'
brew 'facebook/fb/idb-companion'
brew 'ruby-install'
brew 'chruby'
brew 'terminal-notifier'
brew 'wifi-password'
brew 'zsh'
brew 'openssl'
brew 'postgres'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'carthage'
brew 'starship'

# Casks
cask 'adoptopenjdk/openjdk/adoptopenjdk8'
cask 'iterm2'
cask 'visual-studio-code'
cask 'imagealpha'
cask 'imageoptim'
cask 'chromium'
cask 'firefox'
cask 'vlc'
cask 'transmission'
cask 'telegram-desktop'
cask 'calibre'