# Specify a directory to install
cask_args appdir: "/Applications"

# Install packages
tap "homebrew/cask" || true
brew "coreutils"
brew "stow"
brew "git"
brew "git-lfs"
brew "terminal-notifier"
brew "wifi-password"
brew "zsh"
brew "starship"
brew "z"
brew "antidote"

# Casks
cask "iterm2"
cask "visual-studio-code"
cask "imagealpha"
cask "imageoptim"
cask "firefox"
cask "google-chrome"
cask "vlc"
cask "transmission"
cask "calibre"