alefragnani.project-manager
anysphere.cursorpyright
anysphere.remote-containers
apollographql.vscode-apollo
azir-11.azir-vscode-theme
biomejs.biome
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
dbaeumer.vscode-eslint
esbenp.prettier-vscode
github.vscode-pull-request-github
graphql.vscode-graphql
graphql.vscode-graphql-syntax
jolaleye.horizon-theme-vscode
k--kato.intellij-idea-keybindings
loopedautomation.looped-themes
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.python
mvllow.rose-pine
steoates.autoimport
sweetpad.sweetpad
thang-nm.flow-icons
usernamehw.errorlens
vadimcn.vscode-lldb
